///////////////////////////////////////////////////////////////////////////////
// Licensed Materials - Property of IBM
// ZOSLIB
// (C) Copyright IBM Corp. 2020. All Rights Reserved.
// US Government Users Restricted Rights - Use, duplication
// or disclosure restricted by GSA ADP Schedule Contract with IBM Corp.
///////////////////////////////////////////////////////////////////////////////

#define _AE_BIMODAL 1
#undef _ENHANCED_ASCII_EXT
#define _ENHANCED_ASCII_EXT 0xFFFFFFFF
#define _XOPEN_SOURCE 600
#define _OPEN_SYS_FILE_EXT 1
#define _OPEN_MSGQ_EXT 1
#define __ZOS_CC
#include "edcwccwi.h"
#include "zos-base.h"

#include <_Ccsid.h>
#include <_Nascii.h>
#include <__le_api.h>
#include <assert.h>
#include <builtins.h>
#include <ctest.h>
#include <dlfcn.h>
#include <errno.h>
#include <fcntl.h>
#include <iconv.h>
#include <libgen.h>
#include <poll.h>
#include <pthread.h>
#include <signal.h>
#include <stdarg.h>
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <sys/mman.h>
#include <sys/msg.h>
#include <sys/ps.h>
#include <sys/shm.h>
#include <sys/socket.h>
#include <sys/stat.h>
#include <sys/time.h>
#include <time.h>
#include <unistd.h>
#include <sys/epoll.h>
#include <sys/eventfd.h>
#include <sys/inotify.h>

#include <exception>
#include <mutex>
#include <sstream>
#include <unordered_map>
#include <vector>

#if !defined(_gdsa) && defined(__llvm__)
#define _gdsa __builtin_s390_gdsa
#endif

#pragma linkage(_gtca, builtin)
#pragma linkage(_gdsa, builtin)


  unsigned len_b = strlen_ae((unsigned char *)b, &ccsid_b, n, &am_b);
  if (len_a != len_b)
    return len_a - len_b;
  char a_new[len_a + 1];
  char b_new[len_b + 1];
  if (ccsid_a != 819) {
    __convert_one_to_one(__ibm1047_iso88591, a_new, len_a, a);
    a_new[len_a] = 0;
    __convert_one_to_one(ascii_to_lower, a_new, len_a, a_new);
  } else {
    __convert_one_to_one(ascii_to_lower, a_new, len_a, a);
    a_new[len_a] = 0;
  }

  if (ccsid_b != 819) {
    __convert_one_to_one(__ibm1047_iso88591, b_new, len_b, b);
    b_new[len_b] = 0;
    __convert_one_to_one(ascii_to_lower, b_new, len_b, b_new);
  } else {
    __convert_one_to_one(ascii_to_lower, b_new, len_b, b);
    b_new[len_b] = 0;
  }

  return strcmp(a_new, b_new);
}

int get_ipcs_overview(IPCQPROC *info) {
  return __getipc(0, info, sizeof(IPCQPROC), IPCQOVER);
}

void __cleanupipc(int others) {
  IPCQPROC buf;
  int rc;
  int uid = getuid();
  int pid = getpid();
  int stop = -1;

  // Get the number of message queues and shared memory to
  // prevent infinite loop
  if (get_ipcs_overview(&buf) == -1)
    return;

  int count_message_queue = buf.overview.ipcqomsgprivate;
  int count_shared_memory = buf.overview.ipcqoshmkeyed;

  rc = __getipc(0, &buf, sizeof(IPCQPROC), IPCQMSG);

  // Since __getipc has undocumented behaviour, add several checks
  // to prevent infinite looping
  // Experimentation shows that return val of 0 denotes that there
  // are no further IPCS records
  // Check both rc != 0 (undocumented) and rc != -1 (documented)
  // and check if count <= number of message queues
  int count = 0;
  while (rc != 0 && rc != -1 && stop != buf.msg.ipcqmid &&
         count <= count_message_queue) {
    if (stop == -1)
      stop = buf.msg.ipcqmid;
    if (buf.msg.ipcqpcp.uid == uid) {
      if (buf.msg.ipcqkey == 0) {
        if (buf.msg.ipcqlrpid == pid) {
          msgctl(buf.msg.ipcqmid, IPC_RMID, 0);
        } else if (others && kill(buf.msg.ipcqlrpid, 0) == -1 &&
                   kill(buf.msg.ipcqlspid, 0) == -1) {
          msgctl(buf.msg.ipcqmid, IPC_RMID, 0);
        }
      }
    }
    rc = __getipc(rc, &buf, sizeof(buf), IPCQMSG);
  }
  if (others) {
    stop = -1;
    // Since __getipc has undocumented behaviour, add several checks
    // to prevent infinite looping
    // Experimentation shows that return val of 0 denotes that there
    // are no further IPCS records
    // Check both rc != 0 (undocumented) and rc != -1 (documented)
    // and check if count <= number of shared memory
    rc = __getipc(0, &buf, sizeof(buf), IPCQSHM);
    count = 0;
    while (rc != 0 && rc != -1 && stop != buf.shm.ipcqmid &&
           count <= count_shared_memory) {
      if (stop == -1) {
        stop = buf.shm.ipcqmid;
      }
      if (buf.shm.ipcqpcp.uid == uid) {
        if (buf.shm.ipcqcpid == pid) {
          shmctl(buf.shm.ipcqmid, IPC_RMID, 0);
        } else if (kill(buf.shm.ipcqcpid, 0) == -1) {
          shmctl(buf.shm.ipcqmid, IPC_RMID, 0);
        }
      }
      rc = __getipc(rc, &buf, sizeof(buf), IPCQSHM);
    }
  }
}

typedef struct timer_parm {
  int secs;
  pthread_t tid;
} timer_parm_t;

unsigned long __clock(void) {
  unsigned long long value;
  __stckf(&value);
  return ((value / 512UL) * 125UL) - 2208988800000000000UL;
}

static void *_timer(void *parm) {
  timer_parm_t *tp = (timer_parm_t *)parm;
  unsigned long t0 = __clock();
  unsigned long t1 = t0;
  while ((t1 - t0) < ((tp->secs) * 1000000000UL)) {
    sleep(tp->secs);
    t1 = __clock();
  }
  if (__debug_mode) {
    dprintf(2, "Sent abort: __NODERUNTIMELIMIT was set to %d\n", tp->secs);
    raise(SIGABRT);
  }
  return 0;
}

extern void __settimelimit(int secs) {
  pthread_attr_t attr;
  int rc;
  timer_parm_t *tp = (timer_parm_t *)malloc(sizeof(timer_parm_t));
  tp->secs = secs;
  tp->tid = pthread_self();
  rc = pthread_attr_init(&attr);
  if (rc) {
    perror("timer:pthread_attr_init");
    return;
  }
  rc = pthread_create(&_timer_tid, &attr, _timer, tp);
  if (rc) {
    perror("timer:pthread_create");
    return;
  }
  pthread_attr_destroy(&attr);
}
extern "C" void __setdebug(int v) { __debug_mode = v; }
extern "C" int __indebug(void) { return __debug_mode; }

extern "C" void *__dlcb_next(void *last) {
  if (last == 0) {
    return ((char *****__ptr32 *)1208)[0][11][1][113][193];
  }
  return ((char **)last)[0];
}
extern "C" int __dlcb_entry_name(char *buf, int size, void *dlcb) {
  unsigned short n;
  char *name;
  if (dlcb == 0)
    return 0;
  n = ((unsigned short *)dlcb)[44];
  name = ((char **)dlcb)[12];
  char tmpbuf[n + 1];
  return __snprintf_a(
      buf, size, "%-.*s", n,
      __convert_one_to_one(__ibm1047_iso88591, tmpbuf, n, name));
}
extern "C" void *__dlcb_entry_addr(void *dlcb) {
  if (dlcb == 0)
    return 0;
  char *addr = ((char **)dlcb)[2];
  return addr;
}

extern "C" int __dlcb_iterate(int (*cb)(char*, void*, void*), void *data) {
  void *dlcb = 0;
  char buffer[PATH_MAX];
  char filename[PATH_MAX];
  char *libpath = getenv("LIBPATH");
  int r = -1;
  while (dlcb = __dlcb_next(dlcb), dlcb) {
    int len = __dlcb_entry_name(buffer, sizeof(buffer), dlcb);
    void *addr = __dlcb_entry_addr(dlcb);
    if (buffer[0] != '/' && libpath &&
       __find_file_in_path(filename, sizeof(filename), libpath, buffer) > 0) {
      snprintf(buffer + len, sizeof(buffer) - len, " => %s (0x%p)", filename, addr);
    } else
      snprintf(buffer + len, sizeof(buffer) - len, " (0x%p)", addr);
    r = (*cb)(buffer, addr, data);
  }
  return r;
}

extern "C" void abort(void) {
  if (__is_backtrace_on_abort) {
    __display_backtrace(STDERR_FILENO);
  }
  __get_instance()->__abort();
  exit(-1); // never reach here, suppress clang warning
}

extern "C" void __set_backtrace_on_abort(bool flag) {
  __is_backtrace_on_abort = flag;
}

int __cond_timed_wait(unsigned int secs, unsigned int nsecs,
                      unsigned int event_list, unsigned int *secs_rem,
                      unsigned int *nsecs_rem) {
  int rv, rc, rn;
  __bpx4ctw(&secs, &nsecs, &event_list, secs_rem, nsecs_rem, &rv, &rc, &rn);
  if (rv != 0)
    errno = rc;
  return rv;
}

// overriding LE's kill when linked statically
extern "C" int kill(int pid, int sig) {
  int rv, rc, rn;
  __bpx4kil(pid, sig, 0, &rv, &rc, &rn);
  if (rv != 0)
    errno = rc;
  return rv;
}

// overriding LE's fork when linked statically
extern "C" int __fork(void) {
  int cnt = __get_instance()->inc_forkcount();
  int max = __get_instance()->get_forkmax();
  if (cnt > max) {
    dprintf(2,
            "fork(): current count %d is greater than "
            "__NODEFORKMAX value %d, fork failed\n",
            cnt, max);
    errno = EPROCLIM;
    return -1;
  }
#if 0
  int rc, rn, pid;
  __bpx4frk(&pid, &rc, &rn);
  if (-1 == pid) {
    errno = rc;
  }
  return pid;
#else
  int pid = fork();
  if (pid == 0) {
    __get_instance()->forked(1);
  }
  return pid;
#endif
}

// Thread entry constants for __getthent():
#define PGTH_CURRENT 1
#define PGTHACOMMANDLONG 1

extern "C" int __getargcv(int *argc, char ***argv, pid_t pid) {
  // Gets the argv/argc using the thread entry information in the address space.
  // See https://www.ibm.com/docs/en/zos/2.4.0?
  //             topic=31-bpxypgth-map-getthent-inputoutput-structure
  // for the structs mapping below.
#pragma pack(1)
  struct {
    int pid;
    unsigned long thid;
    char accesspid;
    char accessthid;
    char asid[2];
    char loginname[8];
    char flag;
    char len;
  } input_data;

  union {
    struct {
      char gthb[4];
      int pid;
      unsigned long thid;
      char accesspid;
      char accessthid[3];
      int lenused;
      int offsetProcess;
      int offsetConTTY;
      int offsetPath;
      int offsetCommand;
      int offsetFileData;
      int offsetThread;
    } output_data;
    char buf[2048];
  } output_buf;

  struct output_cmd_type {
    char gthe[4];
    short int len;
    char cmd[2048];
  };
#pragma pack()

  int input_length;
  int output_length;
  void *input_address;
  void *output_address;
  struct output_cmd_type *output_cmd;
  int rv;
  int rc;
  int rsn;

  input_length = sizeof(input_data);
  output_length = sizeof(output_buf);
  output_address = &output_buf;
  input_address = &input_data;
  memset(&input_data, 0, sizeof(input_data));
  input_data.flag = PGTHACOMMANDLONG;
  input_data.pid = pid;
  input_data.accesspid = PGTH_CURRENT;

  __bpx4gth(&input_length, &input_address, &output_length, &output_address, &rv,
            &rc, &rsn);

  if (rv == -1) {
    errno = rc;
    return -1;
  }

  // Check first byte (PGTHBLIMITE): A = the section was completely filled in
  __e2a_l((char *)&output_buf.output_data.offsetCommand, 1);
  assert(((output_buf.output_data.offsetCommand >> 24) & 0xFF) == 'A');

  // Command offset is in the lowest 3 bytes (PGTHACOMMANDLONG):
  output_cmd =
      (struct output_cmd_type *)((char *)(&output_buf) +
                                 (output_buf.output_data.offsetCommand &
                                  0x00FFFFFF));

  if ((unsigned long)output_cmd->len >= sizeof(output_cmd->cmd)) {
    errno = EBUFLEN;
    return -1;
  }

  __e2a_l(output_cmd->cmd, output_cmd->len);

  // allocate argv and fill it first with pointers to each arg's address
  // in the same block:
  int i, args_offset, base_args_offset, argi;
  const int ptr_size = sizeof(char *);
  char *argvbuf;

  for (i = 0, *argc = 0; i < output_cmd->len; i++) {
    if (!output_cmd->cmd[i]) {
      *argc += 1;
    }
  }

  // + 1 is for *argv[*argc] to store the pointer to nullptr
  args_offset = (*argc + 1) * ptr_size;
  argvbuf = (char *)malloc(args_offset + output_cmd->len);
  assert(argvbuf != nullptr);
  *argv = (char **)argvbuf;
  memcpy(argvbuf + args_offset, output_cmd->cmd, output_cmd->len);

  base_args_offset = args_offset;

  for (i = 0, argi = 0; i < output_cmd->len; i++) {
    if (!output_cmd->cmd[i]) {
      (*argv)[argi++] = (char *)argvbuf + args_offset;
      // each arg is null-terminated, hence the + 1:
      args_offset = base_args_offset + i + 1;
    }
  }
  (*argv)[argi] = nullptr;
  return 0;
}

extern "C" char **__getargv(void) {
  if (__argv == nullptr) {
    static std::mutex access_lock;
    std::lock_guard<std::mutex> lock(access_lock);
    if (__argv != nullptr)
      return __argv;
    char **tmpargv;
    if (__getargcv(&__argc, &tmpargv, getpid())) {
      perror("__getargcv");
      return nullptr;
    }
    __argv = tmpargv;
  }
  return __argv;
}

extern "C" char **__getargv_a(void) { return __getargv(); }

extern "C" int __getargc(void) {
  if (__getargv())
    return __argc;
  return -1;
}

extern "C" int __getexepath(char *path, int pathlen, pid_t pid) {
  int argc;
  char **argv = nullptr;
  char *stptr;

  if (pid == getpid())
    stptr = __getargv()[0]; // a static, so don't free
  else {
    if (int rc = __getargcv(&argc, &argv, pid))
      return rc;
    stptr = argv[0];
  }
  assert(stptr);
  int len = strlen(stptr);
  if (len >= pathlen) {
    if (argv)
      free(argv);
    errno = EBUFLEN;
    return -1;
  }
  memcpy(path, stptr, len);
  path[len] = 0;
  if (argv)
    free(argv);
  return 0;
}

static notagread_t no_tag_read_behaviour;
static int no_tag_ignore_ccsid1047;

static notagread_t get_no_tag_read_behaviour(const char *envar) {
  char *ntr = __getenv_a(envar);
  if (ntr && !strcmp(ntr, "AUTO")) {
    return __NO_TAG_READ_DEFAULT;
  } else if (ntr && !strcmp(ntr, "WARN")) {
    return __NO_TAG_READ_DEFAULT_WITHWARNING;
  } else if (ntr && !strcmp(ntr, "V6")) {
    return __NO_TAG_READ_V6;
  } else if (ntr && !strcmp(ntr, "STRICT")) {
    return __NO_TAG_READ_STRICT;
  }
  return __NO_TAG_READ_DEFAULT; // default
}

extern "C" notagread_t __get_no_tag_read_behaviour() {
  return no_tag_read_behaviour;
}

static int get_no_tag_ignore_ccsid1047(const char *envar) {
  char *ntr = __getenv_a(envar);
  if (ntr && !strcmp(ntr, "NO")) {
    return 1;
  }
  return 0; // default, consider conversion for txtflag 0 && ccsid 1047
}

extern "C" int __get_no_tag_ignore_ccsid1047() {
  return no_tag_ignore_ccsid1047;
}

extern "C" unsigned long __mach_absolute_time(void) {
  unsigned long long value;
  __stckf(&value);
  return ((value / 512UL) * 125UL) - 2208988800000000000UL;
}

//------------------------------------------accounting for memory allocation
// begin

static const size_t kMegaByte = 1024 * 1024;
static const size_t kGigaByte = 1024 * 1024 * 1024;

static int mem_account(void) {
  static int res = -1;
  if (-1 == res) {
    res = 0;
    char *ma = getenv("__MEM_ACCOUNT");
    if (ma && 0 == strcmp("1", ma)) {
      res = 1;
    }
  }
  return res;
}

static void getxttoken(char *out) {
  void *p;
  asm volatile("  l %0,1208 \n"
               "  llgtr %0,%0 \n"
               "  lg %0,304(%0)\n"
               : "+r"(p)
               :
               : "r0");
  memcpy(out, (char *)p + 0x14, 16);
}

struct iarv64parm {
  unsigned char xversion __attribute__((__aligned__(16))); //    0
  unsigned char xrequest;                                  //    1
  unsigned xmotknsource_system : 1;                        //    2
  unsigned xmotkncreator_system : 1;                       //    2(1)
  unsigned xmatch_motoken : 1;                             //    2(2)
  unsigned xflags0_rsvd1 : 5;                              //    2(3)
  unsigned char xkey;                                      //    3
  unsigned keyused_key : 1;                                //    4
  unsigned keyused_usertkn : 1;                            //    4(1)
  unsigned keyused_ttoken : 1;                             //    4(2)
  unsigned keyused_convertstart : 1;                       //    4(3)
  unsigned keyused_guardsize64 : 1;                        //    4(4)
  unsigned keyused_convertsize64 : 1;                      //    4(5)
  unsigned keyused_motkn : 1;                              //    4(6)
  unsigned keyused_ownerjobname : 1;                       //    4(7)
  unsigned xcond_yes : 1;                                  //    5
  unsigned xfprot_no : 1;                                  //    5(1)
  unsigned xcontrol_auth : 1;                              //    5(2)
  unsigned xguardloc_high : 1;                             //    5(3)
  unsigned xchangeaccess_global : 1;                       //    5(4)
  unsigned xpageframesize_1meg : 1;                        //    5(5)
  unsigned xpageframesize_max : 1;                         //    5(6)
  unsigned xpageframesize_all : 1;                         //    5(7)
  unsigned xmatch_usertoken : 1;                           //    6
  unsigned xaffinity_system : 1;                           //    6(1)
  unsigned xuse2gto32g_yes : 1;                            //    6(2)
  unsigned xowner_no : 1;                                  //    6(3)
  unsigned xv64select_no : 1;                              //    6(4)
  unsigned xsvcdumprgn_no : 1;                             //    6(5)
  unsigned xv64shared_no : 1;                              //    6(6)
  unsigned xsvcdumprgn_all : 1;                            //    6(7)
  unsigned xlong_no : 1;                                   //    7
  unsigned xclear_no : 1;                                  //    7(1)
  unsigned xview_readonly : 1;                             //    7(2)
  unsigned xview_sharedwrite : 1;                          //    7(3)
  unsigned xview_hidden : 1;                               //    7(4)
  unsigned xconvert_toguard : 1;                           //    7(5)
  unsigned xconvert_fromguard : 1;                         //    7(6)
  unsigned xkeepreal_no : 1;                               //    7(7)
  unsigned long long xsegments;                            //    8
  unsigned char xttoken[16];                               //   16
  unsigned long long xusertkn;                             //   32
  void *xorigin;                                           //   40
  void *xranglist;                                         //   48
  void *xmemobjstart;                                      //   56
  unsigned xguardsize;                                     //   64
  unsigned xconvertsize;                                   //   68
  unsigned xaletvalue;                                     //   72
  int xnumrange;                                           //   76
  void *__ptr32 xv64listptr;                               //   80
  unsigned xv64listlength;                                 //   84
  unsigned long long xconvertstart;                        //   88
  unsigned long long xconvertsize64;                       //   96
  unsigned long long xguardsize64;                         //  104
  char xusertoken[8];                                      //  112
  unsigned char xdumppriority;                             //  120
  unsigned xdumpprotocol_yes : 1;                          //  121
  unsigned xorder_dumppriority : 1;                        //  121(1)
  unsigned xtype_pageable : 1;                             //  121(2)
  unsigned xtype_dref : 1;                                 //  121(3)
  unsigned xownercom_home : 1;                             //  121(4)
  unsigned xownercom_primary : 1;                          //  121(5)
  unsigned xownercom_system : 1;                           //  121(6)
  unsigned xownercom_byasid : 1;                           //  121(7)
  unsigned xv64common_no : 1;                              //  122
  unsigned xmemlimit_no : 1;                               //  122(1)
  unsigned xdetachfixed_yes : 1;                           //  122(2)
  unsigned xdoauthchecks_yes : 1;                          //  122(3)
  unsigned xlocalsysarea_yes : 1;                          //  122(4)
  unsigned xamountsize_4k : 1;                             //  122(5)
  unsigned xamountsize_1meg : 1;                           //  122(6)
  unsigned xmemlimit_cond : 1;                             //  122(7)
  unsigned keyused_dump : 1;                               //  123
  unsigned keyused_optionvalue : 1;                        //  123(1)
  unsigned keyused_svcdumprgn : 1;                         //  123(2)
  unsigned xattribute_defs : 1;                            //  123(3)
  unsigned xattribute_ownergone : 1;                       //  123(4)
  unsigned xattribute_notownergone : 1;                    //  123(5)
  unsigned xtrackinfo_yes : 1;                             //  123(6)
  unsigned xunlocked_yes : 1;                              //  123(7)
  unsigned char xdump;                                     //  124
  unsigned xpageframesize_pageable1meg : 1;                //  125
  unsigned xpageframesize_dref1meg : 1;                    //  125(1)
  unsigned xsadmp_yes : 1;                                 //  125(2)
  unsigned xsadmp_no : 1;                                  //  125(3)
  unsigned xuse2gto64g_yes : 1;                            //  125(4)
  unsigned xdiscardpages_yes : 1;                          //  125(5)
  unsigned xexecutable_yes : 1;                            //  125(6)
  unsigned xexecutable_no : 1;                             //  125(7)
  unsigned short xownerasid;                               //  126
  unsigned char xoptionvalue;                              //  128
  unsigned char xrsv0001[8];                               //  129
  unsigned char xownerjobname[8];                          //  137
  unsigned char xrsv0004[7];                               //  145
  void *xdmapagetable;                                     //  152
  unsigned long long xunits;                               //  160
  unsigned keyused_units : 1;                              //  168
  unsigned xunitsize_1m : 1;                               //  168(1)
  unsigned xunitsize_2g : 1;                               //  168(2)
  unsigned xpageframesize_1m : 1;                          //  168(3)
  unsigned xpageframesize_2g : 1;                          //  168(4)
  unsigned xtype_fixed : 1;                                //  168(5)
  unsigned xflags9_rsvd1 : 2;                              //  168(6)
  unsigned xkeyused_inorigin : 1;                          //  169
  unsigned x_rsv0005 : 7;                                  //  169(1)
  unsigned char xrsv0006[6];                               //  170
};

static long long __iarv64(void *parm, long long *reason_code_ptr) {
  long long rc;
  long long reason;
  char *code = ((char *__ptr32 *__ptr32 *__ptr32 *)0)[4][193][52];
  code = (char *)(((unsigned long long)code) | 14); // offset to the entry
  asm volatile(" PC 0(%3)"
               : "=NR:r0"(reason), "+NR:r1"(parm), "=NR:r15"(rc)
               : "a"(code)
               : );
  rc = (rc & 0x0ffff);
  if (rc != 0 && reason_code_ptr != 0) {
    *reason_code_ptr = (0x0ffff & reason);
  }
  return rc;
}

// getipttoken returns the address of the initial process thread library
// anchor area. This is used to create a user token that associates
// memory allocations with the LE enclave.
// See
// https://www.ibm.com/support/knowledgecenter/en/SSLTBW_2.1.0/com.ibm.zos.v2r1.ceev100/mout.htm
unsigned long getipttoken(void) {
  return ((unsigned long)((char *__ptr32 *__ptr32 *__ptr32)(1208))[0][82])
         << 32;
}

